Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: That said, if you provide a setter clause, you must also provide a getter clause.
ja: とは言え、 あなたがセッター節を提供するならば、あなたはまたゲッター節も提供しなければなりません。

source: That said, if you want execution to continue from one case to the next, explicitly include a fallthrough statement, which simply consists of the fallthrough keyword, in the case from which you want execution to continue.
ja: それでもやはり、あなたが実行に１つのケース節から次のものまで続いて欲しいならば、あなたが実行に続いて欲しいケース節で明示的にfallthrough文を含めてください、それは、単にキーワードfallthroughから成ります。

source: That said, it can’t contain any cases that are also marked with the indirect modifier.
ja: とは言うものの、それはindirect修飾子でさらに印されるどんなケース節も含むことはできません。

source: That said, the following changes are available only to code that uses Swift 5.2 or later:
ja: とはいえ、以下の変更はSwift 5.2以降を使用するコードでのみ利用可能です：

source: That said, the initialization processes must end with a call to a designated initializer that ultimately initializes the class’s properties.
ja: とは言え、 初期化プロセスは、最終的にそのクラスのプロパティを初期化する指定イニシャライザに対する呼び出しで終わらなければなりません。

source: That said, you can mark these protocol member declarations with the optional declaration modifier to specify that their implementation by a conforming type is optional.
ja: とは言え、 あなたはこれらのプロトコルメンバー宣言をoptional宣言修飾子を使って印して、ある準拠型にとってそれらの実装が随意であると指定することができます。

source: That said, you can overload a function based on whether a function parameter can throw an error.
ja: とは言え、あなたは関数を、ある関数パラメーターがエラーをスローできるかどうかに基づいてオーバーロードすることができます。

source: That said, you can use parentheses to be explicit about the scope of the operator’s application.
ja: とは言うものの、あなたは丸括弧を使って演算子の適用範囲について明確にすることができます。

source: The """ that ends the literal determines the indentation: Every nonblank line in the literal must begin with exactly the same indentation that appears before the closing """; there’s no conversion between tabs and spaces.
ja: リテラルの終わりの"""はその字下げを決定します：リテラルの中のあらゆる空でない行は、閉じている"""の前に現れるのと正確に同じ字下げで始まらなければなりません；タブと空白の間の変換はありません。

source: The (404, "Not Found") tuple groups together an Int and a String to give the HTTP status code two separate values: a number and a human-readable description.
ja: この(404, "Not Found")タプルはIntとStringをひとつにまとめて、HTTP状態コードに２つの別々の値：数と人間の読める説明を与えます。

source: The @optional, @lazy, @final, and @required attributes are now the optional, lazy, final, and required Declaration Modifiers.
ja: @optional、@lazy、@final、そして@required属性は今やoptional、lazy、final、そしてrequired宣言修飾子です。

source: The @prefix and @postfix attributes for Prefix and Postfix Operators have been replaced by prefix and postfix declaration modifiers.
ja: @prefixと@postfix属性は接頭辞および接尾辞演算子に対して、prefixとpostfix宣言修飾子によって置き換えられました。

source: The Address class also provides a method called buildingIdentifier(), which has a return type of String?.
ja: Addressクラスはまた、buildingIdentifier()と呼ばれるメソッドを提供します、それは、String?の戻り型を持ちます。

source: The Any type represents values of any type, including optional types.
ja: Any型は、オプショナル型を含む、何らかの型の値を表します。

source: The AudioChannel structure also defines a stored instance property called currentLevel, which represents the channel’s current audio level on a scale of 0 to 10.
ja: AudioChannel構造体はまた、currentLevelと呼ばれる格納インスタンスプロパティを定義します、それは、0から10までの目盛りでチャンネルの現在の音声レベルを表わします。

source: The AudioChannel structure defines two stored type properties to support its functionality.
ja: AudioChannel構造体は、その機能性を支えるために２つの格納型プロパティを定義します。

source: The AutomaticallyNamedDocument overrides its superclass’s failable init?(name:) initializer with a nonfailable init(name:) initializer.
ja: AutomaticallyNamedDocumentは、それのスーパークラスの失敗できるinit?(name:)イニシャライザを、失敗できないinit(name:)イニシャライザでオーバーライドします。

source: The Bicycle subclass defines a custom designated initializer, init().
ja: Bicycleサブクラスはあつらえの指定イニシャライザ、init()を定義します。

source: The BlackjackCard structure itself has two properties—rank and suit.
ja: BlackjackCard構造体は、２つのプロパティ ― rankとsuitを持ちます。

source: The Circle class implements the area property requirement as a computed property, based on a stored radius property.
ja: Circleクラスはareaプロパティ要件を、格納radiusプロパティに基づいて計算プロパティとして、満たします。

source: The Circle, Country and Animal classes don’t have a shared base class.
ja: Circle、CountryとAnimalクラスには、共有の基盤クラスがありません。

source: The Container protocol defines three required capabilities that any container must provide:
ja: Containerプロトコルは、あらゆるコンテナ（容れ物）が提供しなければならない３つの必須の能力を定義します：

source: The Counter class also declares a variable property, count, to keep track of the current counter value.
ja: Counterクラスはまた、変数プロパティ、countを宣言して、現在のカウンターの値の情報を得続けます。

source: The Counter class defines three instance methods:
ja: Counterクラスは、３つのインスタンスメソッドを定義します：

source: The Counter class stores its current value in a variable property called count.
ja: Counterクラスは、その現在の値をcountと呼ばれる変数プロパティに保管します。

source: The Counter class, defined below, has an optional dataSource property of type CounterDataSource?:
ja: 下で定義される、Counterクラスは、型CounterDataSource?のオプショナルのdataSourceプロパティを持ちます：

source: The CounterDataSource protocol defines an optional method requirement called increment(forCount:) and an optional property requirement called fixedIncrement.
ja: CounterDataSourceプロトコルは、incrementForCount(_:)と呼ばれるオプショナルのメソッド要件とfixedIncrementと呼ばれるオプショナルのプロパティ要件を定義します。

source: The Customer and CreditCard example shows a situation where one property that is allowed to be nil and another property that cannot be nil have the potential to cause a strong reference cycle.
ja: CustomerとCreditCardの例は、nilであることを許されるあるプロパティとnilであることができないもう１つのプロパティが強い参照循環を引き起こす可能性をもつ状況を示します。

source: The Customer instance now has a strong reference to the CreditCard instance, and the CreditCard instance has an unowned reference to the Customer instance.
ja: Customerインスタンスは現在CreditCardインスタンスへの強い参照を持ちます、そして、CreditCardインスタンスはCustomerインスタンスへの非所有参照を持ちます。

source: The DataManager class has a stored property called data, which is initialized with a new, empty array of String values.
ja: DataManagerクラスはdataと呼ばれる格納プロパティを持ちます、それは、String値の、新規の、空の配列で初期化されます。

source: The Dice class from above can be extended to adopt and conform to TextRepresentable:
ja: 上のDiceクラスは、拡張されることで、TextRepresentableを採用して準拠することができます：

source: The DiceGame protocol is a protocol that can be adopted by any game that involves dice.
ja: DiceGameプロトコルは、さいころが関わるどんなゲームによってでも採用されることができるプロトコルです。

source: The DiceGameDelegate protocol can be adopted to track the progress of a DiceGame.
ja: DiceGameDelegateプロトコルが採用されることで、DiceGameの進捗を追いかけることができます。

source: The Food class also provides a convenience initializer, init(), with no arguments.
ja: Foodクラスはまた、引数のない便宜イニシャライザ、init()を提供します。

source: The FullyNamed protocol requires a conforming type to provide a fully qualified name.
ja: FullyNamedプロトコルは、完全修飾名を提供するある準拠型を要件とします。

source: The HTMLElement class defines a name property, which indicates the name of the element, such as "h1" for a heading element, "p" for a paragraph element, or "br" for a line break element.
ja: HTMLElementクラスはnameプロパティを定義します、それは、要素の名前を示します、例えばヘッダ要素の"h1"、段落要素のための"p"、またはあるいは、改行のための"br"要素など。

source: The HTMLElement class provides a single initializer, which takes a name argument and (if desired) a text argument to initialize a new element.
ja: HTMLElementクラスは１つのイニシャライザを提供します、それは、name引数と（希望する場合には）text引数をとって新しい要素を初期化します。

source: The IntStack type implements all three of the Container protocol’s requirements, and in each case wraps part of the IntStack type’s existing functionality to satisfy these requirements.
ja: IntStack型は、Containerプロトコルの要件の３つすべてを実装します、そしてそれぞれの場合において、これらの要件を満たすためにIntStack型がもつ既存の機能性の一部をラップしています（内部で利用して外側を包む）。

source: The IntStack type shown above can only be used with Int values, however.
ja: しかし、上で示されるIntStack型は、Int値で使われることができるだけです。

source: The Item for C1 must be the same as the Item for C2 (written as C1.Item == C2.Item).
ja: C1のためのItemは、C2のためのItemと同じものでなければなりません（C1.Item == C2.Itemのように書かれます）。

source: The Item for C1 must conform to the Equatable protocol (written as C1.Item: Equatable).
ja: C1のためのItemは、Equatableプロトコルに準拠しなければなりません（C1.Item: Equatableのように書かれます）。

source: The LevelTracker structure is used with the Player class, shown below, to track and update the progress of an individual player:
ja: LevelTracker構造体はPlayerクラスとともに使用され、下で示されるように、個々のプレーヤーの進捗を追跡して更新します：

source: The LevelTracker structure keeps track of the highest level that any player has unlocked.
ja: LevelTracker構造体は、プレーヤーのだれかが鍵を開けた最も高いレベルの情報を得続けます。

source: The LevelTracker structure uses type properties and methods to keep track of which levels of the game have been unlocked.
ja: LevelTracker構造体は、そのゲームのどのレベルが鍵を開けられているかを追跡し続けるために型プロパティとメソッドを使用します。

source: The Matrix subscript’s getter and setter both contain an assertion to check that the subscript’s row and column values are valid.
ja: Matrix添え字のゲッターとセッターは両方とも、添え字のもつrowとcolumn値が有効なことを確認するためにひとつの表明を含みます。

source: The NSCopying attribute behaves in a way similar to the Objective-C copy property attribute.
ja: NSCopying属性は、Objective-Cのcopyプロパティ属性に似たやり方でふるまいます。

source: The NSString length property is now mapped onto Swift’s native String type as utf16Count, not utf16count.
ja: NSStringのlengthプロパティは現在ではスウィフトの生粋のString型とutf16Countとして対応づけられます、utf16countではなく。

source: The Pair structure conforms to Loggable and TitledLoggable whenever its generic type conforms to Loggable or TitledLoggable, respectively.
ja: Pair構造体は、LoggableおよびTitledLoggableに準拠します、それの総称体型がそれぞれLoggableまたはTitledLoggableに準拠する時はいつでも。

source: The Person and Apartment example shows a situation where two properties, both of which are allowed to be nil, have the potential to cause a strong reference cycle.
ja: PersonとApartmentの例は、２つのプロパティ、両方ともnilであることを許されるものが強い参照循環を引き起こす可能性をもつ状況を示します。

source: The Person class has an initializer that sets the instance’s name property and prints a message to indicate that initialization is underway.
ja: Personクラスは、インスタンスのnameプロパティを設定して、初期化が進行中であることを示すためにメッセージを出力するイニシャライザを持ちます。

source: The Person class is defined in the same way as before:
ja: Personクラスは、前の通りに定義されます：

source: The Person instance now has a strong reference to the Apartment instance, and the Apartment instance has a strong reference to the Person instance.
ja: Personインスタンスは現在Apartmentインスタンスへの強い参照を持ちます、そして、ApartmentインスタンスはPersonインスタンスへの強い参照を持ちます。

source: The Person instance still has a strong reference to the Apartment instance, but the Apartment instance now has a weak reference to the Person instance.
ja: Personインスタンスは依然としてApartmentインスタンスへの強い参照を持ちます、しかし、Apartmentインスタンスは現在はPersonインスタンスへの弱い参照を持ちます。

source: The Player class creates a new instance of LevelTracker to track that player’s progress.
ja: Playerクラスは、そのプレーヤーの進捗を追うためにLevelTrackerの新しいインスタンスをつくります。

source: The Player class defines a win(coins:) method, which retrieves a certain number of coins from the bank and adds them to the player’s purse.
ja: Playerクラスはwin(coins:)メソッドを定義します、それは、胴元からコインの特定の数を取り戻して、それらをプレーヤーの財布に加えます。

source: The Player class describes a player in the game.
ja: Playerクラスは、ゲームにおけるプレーヤーを記述します。

source: The Point structure above defines a mutating moveBy(x:y:) method, which moves a Point instance by a certain amount.
ja: 上のPoint構造体は変更moveBy(x:y:)メソッドを定義します、それは、Pointインスタンスを特定の量だけ動かします。

source: The RandomNumberGenerator protocol doesn’t make any assumptions about how each random number will be generated—it simply requires the generator to provide a standard way to generate a new random number.
ja: RandomNumberGeneratorプロトコルは、乱数それぞれが生成される方法について、全く仮定しません ― それは単に生成器に新しい乱数を生み出す標準の方法を提供することを要求します。

source: The Rank enumeration describes the thirteen possible playing card ranks, together with a raw Int value to represent their face value.
ja: Rank列挙は、13のあり得るトランプカードの等級を、それらの額面を表す生のInt値と共に記述します。

source: The RecipeIngredient class has a single designated initializer, init(name: String, quantity: Int), which can be used to populate all of the properties of a new RecipeIngredient instance.
ja: RecipeIngredientクラスは、１つの指定イニシャライザ、init(name: String, quantity: Int)を持ちます、それは、新しいRecipeIngredientインスタンスのプロパティの全てに何か入れるために使われることができます。

source: The Rect structure also provides a computed property called center.
ja: Rect構造体はまた、center（中心）と呼ばれる計算プロパティを提供します。

source: The Residence class is more complex than before.
ja: Residenceクラスは、前より複雑です。

source: The Resolution structure definition and the VideoMode class definition only describe what a Resolution or VideoMode will look like.
ja: Resolution構造体定義とVideoModeクラス定義は、ResolutionまたはVideoModeがどのようなものかについて記述するだけです。

source: The Room class used for the rooms array is a simple class with one property called name, and an initializer to set that property to a suitable room name:
ja: rooms配列のために使用されるRoomクラスは、nameと呼ばれる１つのプロパティ、そしてそのプロパティを適切な部屋名に設定するイニシャライザをもつ単純なクラスです：

source: The Self type isn’t a specific type, but rather lets you conveniently refer to the current type without repeating or knowing that type’s name.
ja: Self型は、特定の型ではありません、しかしいくぶんあなたに便利に現在の型を参照させます、その型の名前を繰り返すことまたは知ることなしに。

source: The Self type refers to the same type as the type(of:) [https://developer.apple.com/documentation/swift/2885064-type] function in the Swift standard library.
ja: Self型は、スウィフト標準ライブラリの中のtype(of:) [https://developer.apple.com/documentation/swift/2885064-type]関数と同じ型を参照します。

source: The Size structure automatically receives an init(width:height:) memberwise initializer, which you can use to initialize a new Size instance:
ja: Size構造体は自動的にメンバー関連イニシャライザinit(width:height:)を受け取ります、それは、あなたが新しいSizeインスタンスを初期化するために使うことができます：

source: The SnakesAndLadders class can be extended to adopt and conform to PrettyTextRepresentable:
ja: SnakesAndLaddersクラスは、拡張されることでPrettyTextRepresentableを採用して準拠するようにできます：

source: The StepCounter class declares a totalSteps property of type Int.
ja: StepCounterクラスは、型IntのtotalStepsプロパティを宣言します。

source: The Suit enumeration describes the four common playing card suits, together with a raw Character value to represent their symbol.
ja: Suit列挙は、トランプの４つの通常のスート（組み札）を、それらの記号を表す生のCharacter値と共に記述します。

source: The TowardsZeroSource class implements the optional increment(forCount:) method from the CounterDataSource protocol and uses the count argument value to work out which direction to count in.
ja: TowardsZeroSourceクラスは、CounterDataSourceプロトコルからのオプショナルのincrement(forCount:)メソッドを実装して、どの方向に数えるべきか解決するためにcount引数値を使います。

source: The TrackedString structure and the value property don’t provide an explicit access-level modifier, and so they both receive the default access level of internal.
ja: TrackedString構造体とvalueプロパティは明確なアクセス水準修飾子を提供しません、なので、それらは両方とも省略時のアクセス水準である内部を受け取ります。

source: The TrackedString structure defines a stored string property called value, with an initial value of "" (an empty string).
ja: TrackedString構造体は、valueと呼ばれる格納文字列プロパティを、""（空の文字列）の初期値で定義します。

source: The Vehicle base class also defines a method called makeNoise.
ja: Vehicleクラスはまた、makeNoiseと呼ばれるメソッドを定義します。

source: The Vehicle class defines common characteristics for an arbitrary vehicle, but is not much use in itself.
ja: Vehicleクラスは、任意の乗物のためのありふれた特徴を定義します、しかしそれ自体では余り役に立ちません。

source: The Vehicle class provides a default value for its only stored property, and does not provide any custom initializers itself.
ja: Vehicleクラスは、それの格納プロパティのためにのみ省略時の値を提供します、そしてそれ自身では何らあつらえのイニシャライザを提供しません。

source: The _height and _width properties store an instance of the property wrapper, TwelveOrLess.
ja: _heightと_widthプロパティは、プロパティラッパー、TwelveOrLessのインスタンスを格納します。

source: The addTwoInts(_:_:) function has the same type as the mathFunction variable, and so this assignment is allowed by Swift’s type-checker.
ja: addTwoInts(_:_:)関数はmathFunction変数と同じ型を持ちます、なので、この代入はスウィフトの型チェッカーによって認められます。

source: The addition and multiplication cases have associated values that are also arithmetic expressions—these associated values make it possible to nest expressions.
ja: additionとmultiplicationケース節は、それもまた算術式である関連値を持ちます—これらの関連値がそれを入れ子式可能なものにします。

source: The airports dictionary is declared as a variable (with the var introducer), and not a constant (with the let introducer), because more airports are added to the dictionary in the examples below.
ja: airports辞書は、変数として（var導入子を使って）宣言されます、定数（let導入子を使って）ではなく、なぜならより多くの空港が下記の例でこの辞書に加えられるからです。

source: The airports dictionary is declared as having a type of [String: String], which means “a Dictionary whose keys are of type String, and whose values are also of type String”.
ja: airports辞書は、[String: String]の型を持つとして宣言されます、それは「キーが型Stringであり、値もまた型StringであるDictionary」を意味します。

source: The airports dictionary is initialized with a dictionary literal containing two key-value pairs.
ja: airports辞書は、２つの「キーと値」の対を含んでいるひとつの辞書リテラルで初期化されます。

source: The allEqual() method returns true only if all the elements in the collection are equal.
ja: allEqual()メソッドがtrueを返すのは、そのコレクションの中の要素すべてが同等である場合のみです。

source: The allItemsMatch(_:_:) function starts by checking that both containers contain the same number of items.
ja: allItemsMatch(_:_:)関数は、両方のコンテナが同じ数の項目を含むことを確認することによって始まります。

source: The arch(arm) platform condition does not return true for ARM 64 devices.
ja: arch(arm)プラットホーム条件は、ARM 64機器に対してtrueを返しません。

source: The as! operator performs a forced cast of the expression to the specified type.
ja: as!演算子は式の指定された型への強制的なキャストを実行します。

source: The as! version of the downcast operator forces the downcast to the protocol type and triggers a runtime error if the downcast doesn’t succeed.
ja: as!版のダウンキャスト演算子は、そのプロトコル型へのダウンキャストを強制して、ダウンキャストが成功しなかったならば実行時エラーの引き金を引きます。

source: The as operator performs a cast when it is known at compile time that the cast always succeeds, such as upcasting or bridging.
ja: as演算子は、コンパイル時にそのキャストが常に成功することを知られているキャストを実行します、例えばアップキャストやブリッジなど。

source: The as pattern matches a value if the type of that value at runtime is the same as the type specified in the right-hand side of the as pattern—or a subclass of that type.
ja: asパターンは、ある値にマッチします、もしその値の実行時での型がasパターンの右側で指定される型 ― または、それの型のサブクラス ― と同じものであるならば。

source: The as? operator performs a conditional cast of the expression to the specified type.
ja: as?演算子は式の指定された型への条件付きキャストを実行します。

source: The as? version of the downcast operator returns an optional value of the protocol’s type, and this value is nil if the instance doesn’t conform to that protocol.
ja: as?版のダウンキャスト演算子は、そのプロトコルの型のオプショナルの値を返します、そしてインスタンスがそのプロトコルに準拠しないならばその値はnilです。

source: The asHTML property is declared as a lazy property, because it’s only needed if and when the element actually needs to be rendered as a string value for some HTML output target.
ja: asHTMLプロパティは遅延プロパティとして宣言されます、なぜなら、要素が何らかのHTML出力対象のために実際に文字列値として解釈される必要がもしもあるときのみそれが必要なだけだからです。

source: The asHTML property is named and used somewhat like an instance method.
ja: asHTMLプロパティは、いくぶんインスタンスメソッドのように名前をつけられて、使われます。

source: The available attribute always appears with a list of two or more comma-separated attribute arguments.
ja: available属性は、常に２つ以上のコンマで区切られた属性引数とともに現れます。

source: The balance(_:_:) function above modifies its two parameters to divide the total value evenly between them.
ja: 上のbalance(_:_:)関数は、それの２つのパラメータを修正して、それらの間でその合計値を均等に分割するようにします。

source: The beginConcert(in:) function takes a parameter of type Location & Named, which means “any type that’s a subclass of Location and that conforms to the Named protocol.” In this case, City satisfies both requirements.
ja: beginConcert(in:)関数は、型Location & Namedのパラメータを１つとります、それは「Locationのサブクラスであり、Namedプロトコルに準拠する何らかの型」を意味します。この場合では、Cityは両方の要件を満たします。

source: The block argument indicates an Objective-C compatible block reference.
ja: block引数は、Objective-C互換ブロック参照を指し示します。

source: The boardColors array is initialized with a closure to set up its color values:
ja: boardColors配列は、その色値を設定するために、クロージャで初期化されます：

source: The break gameLoop statement transfers control to the first line of code outside of the while loop, which ends the game.
ja: break gameLoop文は、制御をwhileループの外側のコードの最初の行へ移します、そしてゲームを終了します。

source: The break statement ends execution of an entire control flow statement immediately.
ja: break文は、ある制御の流れに関する文まるまる全体の実行を直ちに終えます。

source: The c argument indicates a C function reference.
ja: c引数は、C関数参照を指し示します。

source: The capitalCity property can be used and accessed like a non-optional value once initialization is complete, while still avoiding a strong reference cycle.
ja: capitalCityプロパティは、一旦初期化が完了すれば、非オプショナルの値のように使用およびアクセスされることが可能です、その一方で依然として強い参照循環を防ぎます。

source: The case above has two patterns: (let distance, 0) matches points on the x-axis and (0, let distance) matches points on the y-axis.
ja: 上のcaseは、２つのパターンを持ちます：(let distance, 0)はx軸上の点にマッチします、そして(0, let distance)はy軸上の点にマッチします。

source: The catch clauses don’t have to handle every possible error that the code in the do clause can throw.
ja: catch節は、do節の中のコードがスロー可能なすべての起こりうるエラーを取り扱う必要はありません。

source: The center property is then set to a new value of (15, 15), which moves the square up and to the right, to the new position shown by the orange square in the diagram below.
ja: centerプロパティは、それから新しい値(15, 15)に設定されます、それは、正方形を上にそして右に、下記の図においてオレンジの正方形によって示される新しい位置へと動かします。

source: The continue statement tells a loop to stop what it is doing and start again at the beginning of the next iteration through the loop.
ja: continue文は、あるループにそれがしていることを止めて、そのループの次の繰り返しの始めのところで再び始めるように言います。

source: The continue, break, and fallthrough statements are described below.
ja: continue、break、そしてfallthrough文は、以下で記述されます。

source: The convention attribute always appears with one of the following arguments:
ja: convention属性は常に以下の引数の１つと共に現れます：

source: The currentLevel property has a didSet property observer to check the value of currentLevel whenever it is set.
ja: currentLevelプロパティはdidSetプロパティオブザーバーを持ち、currentLevelの値をそれが設定されるときはいつでも調べるようにします。

source: The deprecated argument indicates the first version of the specified platform or language in which the declaration was deprecated.
ja: deprecated引数は、そこにおいてその宣言が非推奨とされたところの、指定されたプラットホームまたは言語の最初のバージョンを指し示します。

source: The didSet clause is optional when you provide a willSet clause.
ja: あなたがwillSet節を提供するとき、didSet節は任意です。

source: The didSet observer is called after the value of totalSteps is updated.
ja: didSetオブザーバーは、totalStepsの値が更新された後に呼ばれます。

source: The distribute(coins:) method checks that there are enough coins in the bank before distributing them.
ja: distribute(coins:)メソッドは、十分なコインがそれらを配布する前に胴元にあることを確認します。

source: The do statement is used to introduce a new scope and can optionally contain one or more catch clauses, which contain patterns that match against defined error conditions.
ja: do文は、ある新しいスコープを導入するために使われます、そして随意に１つ以上のcatch節を含むことができ、それは定義されたエラー条件にマッチするパターンを複数含みます。

source: The else clause of a guard statement is required, and must either call a function with the Never return type or transfer program control outside the guard statement’s enclosing scope using one of the following statements:
ja: guard文のelse節は必ず必要です、そしてNever戻り型を持つ関数を呼び出すか、プログラム制御をguard文の囲むスコープの外側に以下の文のうちの１つを使って移すか、どちらかをする必要があります。

source: The fallthrough keyword does not check the case conditions for the switch case that it causes execution to fall into.
ja: fallthroughキーワードは、それが実行を落としていく先のswitchケース節のためのケース節条件を調べません。

source: The favoriteGenres set is declared as a variable (with the var introducer) and not a constant (with the let introducer) because items are added and removed in the examples below.
ja: favoriteGenres集合は、定数（let導入子を使って）ではなく変数として（var導入子を使って）宣言されます、項目が下の例で加えられたり取り除かれたりするためです。

source: The favoriteGenres variable is declared as “a set of String values”, written as Set<String>.
ja: favoriteGenres変数は、Set<String>のように書かれ、「String値の集合」として宣言されます。

source: The findIndex(of:in:) function now compiles successfully and can be used with any type that is Equatable, such as Double or String:
ja: findIndex(of:in:)関数は、今やうまくコンパイルして、Equatableであるどんな型とでも使われることができます、例えばDoubleやStringなど：
